<?php

	/* --------------------------------------------
	    KKBSign class
		-------------
		by Kirsanov Anton (webcompass@list.ru)
		01.06.2006	
	   ------------------------------------------*/

	// -----------------------------------------------------------------------------------------------------------------
	// Константы

	define("MERCHANT_CERT_ID",	"12345678");	// Серийный номер сертификата
	define("MERCHANT_NAME",		"Test shop");	// Название магазина (продавца)
	define("ORDER_ID",			"000001");		// Уникальный номер заказа
	define("CURRENCY",			"840");			// ID валюты. 840 - USD
	define("MERCHANT_ID",		"1");			// ID продавца в системе
	define("AMOUNT", 			"1");			// сумма заказа


	// -----------------------------------------------------------------------------------------------------------------
	// Include модуля

	require_once("kkbsign.class.php");


	// -----------------------------------------------------------------------------------------------------------------
	// Создание объекта

	$kkb = new KKBSign();

	// -----------------------------------------------------------------------------------------------------------------
	// Переворачиваем ключ
	
	$kkb->invert();

	// -----------------------------------------------------------------------------------------------------------------
	// Открываем публичный ключ.

	$kkb->load_private_key("test.pem", "test");


	// -----------------------------------------------------------------------------------------------------------------
	// Шаблон заказа

	$merchant = '<merchant cert_id="%certificate%" name="%merchant_name%"><order order_id="%order_id%" amount="%amount%" currency="%currency%"><department merchant_id="%merchant_id%" amount="%amount%"/></order></merchant>';

	// -----------------------------------------------------------------------------------------------------------------
	// Подготовка данных заказа, обработка шаблона

	$merchant = preg_replace('/\%certificate\%/', 		MERCHANT_CERT_ID , 	$merchant);
	$merchant = preg_replace('/\%merchant_name\%/', 	MERCHANT_NAME , 	$merchant);
	$merchant = preg_replace('/\%order_id\%/', 			ORDER_ID, 			$merchant);
	$merchant = preg_replace('/\%currency\%/', 			CURRENCY, 			$merchant);
	$merchant = preg_replace('/\%merchant_id\%/', 		MERCHANT_ID, 		$merchant);
	$merchant = preg_replace('/\%amount\%/', 			AMOUNT,				$merchant);

	// -----------------------------------------------------------------------------------------------------------------
	// Подготавливаем подпись

	$merchant_sign = '<merchant_sign type="RSA">'.$kkb->sign64($merchant).'</merchant_sign>';


	// -----------------------------------------------------------------------------------------------------------------
	// Составляем пакет

	$xml = "<document>".$merchant.$merchant_sign."</document>";


	// -----------------------------------------------------------------------------------------------------------------
	// Выводим пакет

	echo $xml;

	// -----------------------------------------------------------------------------------------------------------------
	// echo base64_encode($xml); // Готовый пакет для переменной Signed_Order_B64

?>